<template>
  <f-card
    title="区域加载"
    v-loading="loading"
    fan-loading-text="Loading..."
    fan-loading-background="rgba(122, 122, 122, 0.8)"
  >
    内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容
  </f-card>
</template>

<script setup lang="ts">
import { ref } from 'vue'
const loading = ref(true)
setTimeout(() => {
  loading.value = false
}, 10000)
</script>
